{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Daniel Gális",
	"language": "en",
	"home_page_url": "https://danielgalis.com/",
	"feed_url": "https://danielgalis.com/feed/feed.json",
	"description": "Daniel Gális is a designer, researcher and developer working with web technologies.",
	"author": {
		"name": "Daniel Gális",
		"url": "https://danielgalis.com"
	},
	"items": [
		{
			"id": "https://danielgalis.com/posts/review-phone-children/",
			"url": "https://danielgalis.com/posts/review-phone-children/",
			"title": "Review of &quot;End the Phone-Based Childhood Now&quot; by Jonathan Haidt",
			"content_html": "<p>Jonathan Haidt’s article, <em>&quot;End the Phone-Based Childhood Now,&quot;</em> published in <em>The Atlantic</em> in March 2024 provides a comprehensive analysis on how growing up with smartphones and social media has negatively impacted Gen Z. The journalistic yet research-driven style makes his critique very digestible for the general public.</p>\n<p>Haidt is a social psychologist known for his work on moral psychology. He frames smartphones as a disruptive force that undermines mental health and personal development by limiting engagement in the real world while introducing new forms of risk. This article is especially relevant to my bachelor’s thesis, which explores pre-teens’ relationship with smartphones as a starting point for designing a new type of handheld computer.</p>\n<p>A particularly compelling passage from Haidt reads:</p>\n<blockquote>\n<p>Social media has trapped an entire generation in a collective-action problem. Early app developers deliberately and knowingly exploited the psychological weaknesses and insecurities of young people to pressure them to consume a product that, upon reflection, many wish they could use less, or not at all. (Haidt, 2024)</p>\n</blockquote>\n<p>This insight is vital to my research, as it underscores how the architecture of social media is inherently exploitative. Accepting this fact is crucial for moving beyond traditional control-based interventions, such as restricting screen time, and considering more transformative approaches.</p>\n<p>Haidt’s proposed solutions, centred on community-based efforts align with his broader vision of societal responsibility in addressing the problematic smartphone use. However, while I believe communities can be extremely effective in creating change, we also need to shape technology to serve out society better. My thesis emphasises the role of design by prototyping a new kind of handheld computer that fosters calm, safe and even non-verbal interaction. If we have technology that encourages more intentional and mindful engagement, we will not have a problem with regulating device use in the first place. I believe this perspective complements Haidt’s approach, ensuring a more systemic solution.</p>\n<h3 id=\"reference\" tabindex=\"-1\">Reference: <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/review-phone-children/#reference\">#</a></h3>\n<p>Haidt, J. (2024, March 13). End the Phone-Based Childhood Now. The Atlantic. https://www.theatlantic.com/technology/archive/2024/03/teen-childhood-smartphone-use-mental-health-effects/677722/</p>\n",
			"date_published": "2024-11-24T00:00:00Z"
		}
		,
		{
			"id": "https://danielgalis.com/posts/walking/",
			"url": "https://danielgalis.com/posts/walking/",
			"title": "Walking Through Educational Environments",
			"content_html": "<p>It is a sad reality that most young people today choose their studies purely based on what degree is supposed to make them money, satisfy their parents, or be easy enough to coast through while enjoying the benefits of student life. Instead of striving for higher values that might enrich the mind and the spirit, most students today see higher education as purely transactional in nature. The student honours their part of the deal by cramming enough information the night before, in order to get a satisfactory score on a test, or squeezing out enough words on a page to construct a gradable paper. Students are highly conscious of what exchange of information is taking place, but there is very little being attentive and present in the present moment<sup class=\"footnote-ref\"><a href=\"https://danielgalis.com/posts/walking/#fn1\" id=\"fnref1\">[1]</a></sup>.</p>\n<p>As much as I despise these calculating, entitled attitudes in students, I don’t blame them. These are honestly quite pragmatic strategies of survival. The widespread disillusionment with modern day academia that causes people to simply not care is very familiar to me as well. I am certainly very critical of contemporary higher education. I believe a lot of universities have become more akin to factories, producing future professional workers, rather than facilitating any semblance of truly “higher” education. My personal scepticism has just driven me in a different direction, exploring alternative education.</p>\n<p>I thrive in alternative education environments. That is exactly the reason why the Sustainability Intensive led by Jan van Boeckel appealed to me. In my experience, just the simple change of environment from a classroom to the outside world unlocks a new potential of insight. For most of human history, people absorbed new information surrounded by natural forms, fresh air and all of the little sights, sounds and smells that we experienced in Arbavere. Physical surroundings matter just as much as methodology. I learn considerably more when I can be slightly “distracted” by watching a leaf fall to the ground or a bird chase after a small insect.</p>\n<p>I would argue that this spacial, physical context plays a part in why walking can be such a potent method of learning. Walking doesn’t provide us a more complete or true view, rather it allows us to be out-of-position, transgressing a subjective standpoint for a view beyond every possible position. When walking along a trail, the trail imposes on us with a certain authority, it commands our gaze<sup class=\"footnote-ref\"><a href=\"https://danielgalis.com/posts/walking/#fn1\" id=\"fnref1:1\">[1:1]</a></sup>. When walking, we become one with the totality of the real world, observing the environment not in series, but in parallel<sup class=\"footnote-ref\"><a href=\"https://danielgalis.com/posts/walking/#fn2\" id=\"fnref2\">[2]</a></sup>. There is no walking without a trail, as even when we step foot somewhere no other person has ever stepped before, we blaze a completely new trail.</p>\n<p>The question then arrises: can we find, or blaze a trail in a traditional classroom environment? Most definitely not in the literal sense, and I struggle to find trails in a metaphorical sense. A classroom has been constructed to provide subjects (students) a position in relation to the object (study material). There is no looking beyond every perspective when a student is confined to a single chair. As I’ve come to understand, physical surroundings matter just as much as methodology. For me, this has been the most important takeaway stemming from this whole experience.</p>\n<p>As I try to integrate this newfound insight into my life, I often find myself cold, writing and sketching in places that could almost be labeled a park. The harsh Estonian weather in winter months doesn’t play well with outside learning. As much as I like to think of myself as a hardened individual, the elements send me inside sooner or later. And then there are still the classrooms I have to visit in order to fulfil my end of the higher education deal.</p>\n<p>Learning inside, I easily become restless, distracted and frustrated. This becomes worse if I am alone in an isolated space. Without gentle reminders of the ever-shifting life all around me, no subjective perspective is being transgressed, instead I just revert to chasing instant gratification or falling sleep.</p>\n<p>As much as I love to imagine a world where I could always be learning and creating outside of houses, schools and coffee shops, it is not realistic and may even be a paradox of sorts, as I love to use and create digital tools. What I can do is try to re-shape my environments. I am reminded of the “Silent Becoming” clay modelling workshop we participated in on the first day. How can I find the missing links between the workspaces accessible to me and the beautiful natural environments I find myself longing after? Maybe closing my eyes while I shape them can help.</p>\n<h3 id=\"reference\" tabindex=\"-1\">Reference: <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/walking/#reference\">#</a></h3>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Masschelein, J. (2010). E-ducating the gaze: The idea of a poor pedagogy. Ethics and Education, 5(1), 43–53. https://doi.org/10.1080/17449641003590621 <a href=\"https://danielgalis.com/posts/walking/#fnref1\" class=\"footnote-backref\">↩︎</a> <a href=\"https://danielgalis.com/posts/walking/#fnref1:1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n<li id=\"fn2\" class=\"footnote-item\"><p>Nachmanovitch, S. (2007). Bateson and the Arts. Kybernetes, 36(7/8), 1122–1133. https://doi.org/10.1108/03684920710777919 <a href=\"https://danielgalis.com/posts/walking/#fnref2\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n",
			"date_published": "2024-11-11T00:00:00Z"
		}
		,
		{
			"id": "https://danielgalis.com/posts/erg-letter/",
			"url": "https://danielgalis.com/posts/erg-letter/",
			"title": "erg motivational letter",
			"content_html": "<p>Dear ~,</p>\n<p>I am expressing my interest in an exchange at erg. As a student at the BUT Faculty of Fine Arts, specifically in Graphic Design Studio 1, I am enthusiastic about the opportunity to broaden my academic horizons, refine my design skills, and immerse myself in new cultural experiences.</p>\n<p>My studies at AGD1 have equipped me with a solid foundation in research, visual design, digital product design, and programming. These skills have been instrumental in completing projects such as the MacOS app <a href=\"https://danielgalis.com/projects/tomado\">Tomado</a> and the IoT device <a href=\"https://danielgalis.com/projects/keybot\">Keybot</a>.</p>\n<p>I am proficient in Adobe Creative Suite, Figma and Fusion 360, can analyse and visualise data with Python, create websites using HTML, CSS, and JavaScript, and program microcontrollers in C. I have hands-on experience creating physical prototypes with 3D printing, paper, and IoT components. I am always eager to learn new skills or master some of those already in my toolbelt.</p>\n<p>Furthermore, collaborative activities like working on the community radio <a href=\"https://danielgalis.com/projects/flus\">flus.fm</a> and organising <a href=\"https://purefucking.fun/pages/ojs.html\">OPEN JAM SESSIONS</a> honed my soft skills in project management and fostered a passion for interdisciplinary collaboration. These experiences will enable me to contribute actively to the academic community of your institution.</p>\n<p>I will apply these creative, technical and soft skills in a broader context. I want to work individually and on group projects, creating visuals, products, tools and communities. My hunger for knowledge drives me to seek out challenging academic pursuits, this exchange being one of them.</p>\n<p>I wholeheartedly believe that carefully designed technology can make people's lives better. I'm fascinated by digital tools and services that help individuals and communities gain control of their time, data and environments, expanding their agency in the digital realm.</p>\n<p>The exchange as erg is an opportunity to dive deep into my research. I would love to continue exploring recipes and intuitive cooking in my project <a href=\"https://danielgalis.com/projects/cookbook\">cookbook</a>. Two research questions have already arisen from my explorations:</p>\n<blockquote>\n<p>The essential function of a recipe is documenting an experience for oneself and others, thus preserving and accumulating knowledge. But following exact recipes also limits the development of one’s intuition and sharpening of one's senses, instead trusting the opinion of an “expert” to achieve a certain reproducible, “branded” meal. Following instructions can feel like a game, but it also feels restraining and creates unnecessary expectations. Similar to society's roles, a recipe is something you have to fit into. How can we redesign recipes so that they still preserve knowledge, but don't perpetuate the toxic nature of exactness?</p>\n</blockquote>\n<blockquote>\n<p>In my opinion, the AIs of today (LLMs, LIMs…) are better described as “very limited artificial intuition” rather than “artificial intelligence”. Everything they produce is made up on the spot, referencing training data in a hazy rather than exact way. Can we leverage computer intuition in building our intuition?</p>\n</blockquote>\n<p><a href=\"https://danielgalis.com/projects/flus\">flus.fm</a> in another project with great research potential. I see it as a live collaborative sound medium, similar to an offline jam session. I’m interested in the interplay of scheduled programming and live broadcasts from many distributed broadcasters - creating an environment for play and two-way sound-based communication. The main inspiration for my research into online radio is the French project <a href=\"https://p-node.org/\">∏Node</a>, which I would love to explore in detail and build my versions of their hardware designs.</p>\n<p>I’ve selected the Digital Design orientation, which unites my lifelong love of technology with user-centric, research-driven design. I want to continue exploring tools-for-thought, handmade websites, and collaborative sound (online and offline) all the while diving into new territories.</p>\n<p>I am particularly attracted to the opportunity to live and study in Brussels, which will provide me with a rare cultural experience and broaden my understanding of the local design practice. Working with diverse teams on international projects is a personal dream that will become more attainable thanks to the Erasmus+ programme.</p>\n<p>I am fully committed to making the most of this opportunity. An exchange semester will contribute to my design practice and future career in design. Alongside personal growth, I am keen to contribute meaningfully to my host institution and bring back a wealth of knowledge to share with my peers and faculty at FFA BUT.</p>\n<p>Thank you for considering my application for the Erasmus+ programme. I am eager to embark on this enriching study abroad experience that will shape my academic and professional journey.</p>\n<p>Yours sincerely, <a href=\"https://danielgalis.com/\">Daniel Gális</a></p>\n",
			"date_published": "2024-05-01T00:00:00Z"
		}
		,
		{
			"id": "https://danielgalis.com/posts/sample-terminal/",
			"url": "https://danielgalis.com/posts/sample-terminal/",
			"title": "Sampling music in the MacOS terminal",
			"content_html": "<p>Hello internet traveler! Do you want to download music from YouTube, but hate using shady web converters? I sure do. Here is a cleaner and faster way to download and sample all your favourite music using open-source software.</p>\n<p>We'are gonna be using a Python package called <strong>yt-dlp</strong> (have a look at it's <a href=\"https://github.com/yt-dlp/yt-dlp\">GitHub</a>). MacOS already comes with Python, so the installation process should be straightforward. Try entering <code>pip install yt-dlp</code> into your Terminal, or reference the <a href=\"https://github.com/yt-dlp/yt-dlp#installation\">guide</a> for detailed instructions. To check if you have <strong>yt-dlp</strong> installed, enter `yt-dlp --version`` into your Terminal. The version number should be printed out.</p>\n<p>To extract audio only files from videos, we're also gonna need <strong>ffmpeg</strong> and <strong>ffprobe</strong>. Download <strong>ffmpeg</strong> from their <a href=\"https://ffmpeg.org/download.html#build-mac\">official site</a> and <strong>ffprobe</strong> should come included. To test if the installation was successful, try entering this <code>ffmpeg</code> into your Terminal. You should see a bunch of information about the package.</p>\n<p>To set up an easy and replicable way of using <strong>yt-dlp</strong>, we have to modify our shell configuration file. For me (and most current version MacOS users), this is <code>~/.zshrc</code>. you can find it using the <code>Shift + Command + G</code> shortcut in Finder and typing in the afformentioned filepath (<code>~/.zshrc</code>). This is just a simple text file, so editing it via TextExit works perfect.</p>\n<p>Just add this silly little code (a shell function definition) to your shell configuration file, save it and you should be set. If you want to download to a different folder, just modify the <code>--output</code> parameter (in my case it is <code>~/Music</code>, where <code>~</code> is the user home directory).</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\"><span class=\"token keyword\">function</span> <span class=\"token function-name function\">sample</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    yt-dlp <span class=\"token parameter variable\">-f</span> <span class=\"token string\">'ba/b'</span> --default-search <span class=\"token string\">\"ytsearch\"</span> --extract-audio --audio-format wav <span class=\"token parameter variable\">--output</span> <span class=\"token string\">'~/Music/%(title)s.%(ext)s'</span> <span class=\"token variable\">$1</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>Now, when you open a new Terminal, you can download audio from YouTube by simply entering this command:</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">sample <span class=\"token string\">\"your-youtube-link\"</span></code></pre>\n<p>The .wav file should be at your specified <code>--output</code> directory.</p>\n<p>As a bonus, you can also enter keywords inside the quotation marks to search YouTube instead od providing a direct link. If you run into any trouble, or are not sure about something, please feel free to hit me up on <a href=\"https://discordapp.com/users/147823743882756096\">Discord</a>.</p>\n<p>Have fun sampling!</p>\n",
			"date_published": "2024-03-08T00:00:00Z"
		}
		,
		{
			"id": "https://danielgalis.com/posts/arc-boosts/",
			"url": "https://danielgalis.com/posts/arc-boosts/",
			"title": "I made a skin for Are.na",
			"content_html": "<p>I've started playing around with the Boost feature of <a href=\"https://arc.net/\">Arc Browser</a>. Here's an <a href=\"https://arc.net/gift/55fb6b96\">invite</a> if you haven't tried Arc yet.</p>\n<p>Boosts offer the ability to customise a page by changing its colours, fonts, and even hiding specific sections. If you have web coding knowledge, you can go a step further and write custom CSS and JavaScript. However, Boosts containing JavaScript cannot be shared with others.</p>\n<p>This post serves as a gallery of my favorite Boosts, including the ones I've created. To try out a Boost, simply click on its name, which will be highlighted in blue.</p>\n<h2 id=\"green-pea-are-na-skin\" tabindex=\"-1\"><a href=\"https://arc.net/boost/773D0300-DEA6-4453-A4A0-921E9E6F857D\">green pea are.na skin</a> <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/arc-boosts/#green-pea-are-na-skin\">#</a></h2>\n<p>My personal pea flavoured skin for <a href=\"https://are.na\">are.na</a>.</p>\n<p>![[are.na-skin.png|green pea are.na skin screenshot]]</p>\n<h2 id=\"no-youtube-shorts-please\" tabindex=\"-1\"><a href=\"https://arc.net/boost/C05314CD-FE01-43E2-8D5C-D4B15BB4879B\">No YouTube Shorts Please</a> <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/arc-boosts/#no-youtube-shorts-please\">#</a></h2>\n<p>Simple as that. Improves YouTube by 100%.</p>\n<p>I also recommend using the Chromium extension <a href=\"https://chrome.google.com/webstore/detail/rabbit-hole-for-youtube/nlddakjbmpidooplakalfoogdincflfh\">Rabbit Hole for YouTube</a> for disabling algorithmic recommendations.</p>\n<p>![[youtube-rabbit-hole.png|youtube without disctractions screenshot]]</p>\n<h2 id=\"simplegram-dms\" tabindex=\"-1\"><a href=\"https://arc.net/boost/CEA44E38-E8E2-4F87-BBB8-5FE32E84AC0B\">Simplegram + DMs</a> <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/arc-boosts/#simplegram-dms\">#</a></h2>\n<p>Brings back that long-gone original Instagram vibe.</p>\n<p>I remixed the beautiful <a href=\"https://arc.net/boost/F408757E-3894-4B68-9762-891CD59EA41C\">Siplegram</a> boost by Ellis Hamburger by bringing back DMs, as this is the only feature of IG I use daily. After some actual use, I've decided to bring back the Create button aswell, to allow posting from my computer.</p>\n<p>![[simplegram-dms.png|simplegram + dms screenshot]]</p>\n",
			"date_published": "2023-08-30T00:00:00Z"
		}
		,
		{
			"id": "https://danielgalis.com/posts/public-digital-garden/",
			"url": "https://danielgalis.com/posts/public-digital-garden/",
			"title": "Thoughts On a Public Digital Garden",
			"content_html": "<p>Here are my current thoughts on this website in relation to other tools-for-thought I enjoy using.</p>\n<h2 id=\"notes-and-blogs\" tabindex=\"-1\">Notes and blogs <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/public-digital-garden/#notes-and-blogs\">#</a></h2>\n<p>As much I love the idea of tending to a <a href=\"https://danielgalis.com/posts/public-digital-garden/\">digital garden</a>, I've come to the conclusion that I want to keep my notes and my blog separate. I have been writing in my Obsidian vault for a while now, but I don't think hosting all of my notes publicly can bring me, or anyone else for that matter, any value or joy. In my experience, digital gardens are fun to explore for a while, but I much prefer reading &quot;traditional&quot; blogposts. I think my <a href=\"https://are.na/danielgalis\">are.na</a> is a great public #second-brain. Anyone truly interested can scour through my channels and a get a good sense what I'm thinking about and what I'm vibing with. I'm all for <a href=\"https://notes.andymatuschak.org/Work_with_the_garage_door_up\">working with the garage door up</a>, but some notes are best kept private.</p>\n<p>The main process to figure out is the pipeline from note to blog. Interaction-wise, it should be controlled by text only, no buttons, no extra formatting and ideally no copy-paste. Just type something into the note's <a href=\"https://frontmatter.codes/docs/markdown\">Front Matter</a> that automatically turns it into a blogpost. Or makes it public. I don't (want to) know what a blogpost is and isn't.</p>\n<h2 id=\"website-as-a-homepage\" tabindex=\"-1\">Website as a homepage <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/public-digital-garden/#website-as-a-homepage\">#</a></h2>\n<p>My main goal is to use &amp; reference my website (almost) daily. It is first and foremost mine. A tool for thought, but more generally a tool for digital being, or just for being. Just a tool. Not really a portfolio, not a SEO-maxed blog, not something you link to in your bio just to get traction on a new product. No bullshit. It can become all those things, and more, but slowly and organically, with new features emerging out of my actual use. The MVP is for me. Later, my website can become more inclusive and/or participatory. This website is my homepage.</p>\n<h2 id=\"ways-i-would-like-to-use-a-website\" tabindex=\"-1\">Ways I Would Like To Use a Website <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/public-digital-garden/#ways-i-would-like-to-use-a-website\">#</a></h2>\n<p>Posting texts, mostly reflections on things I learned, made, read and done. They should be atomic, focused on a single topic.</p>\n<p>Editing these texts continually. The posting is more of a start than a finish.</p>\n<p>Opening a window into my life for anyone interested. Sharing up to date information about myself.</p>\n<p>Presenting my work in a way that is easy to navigate and explore.</p>\n<p>Tracking some metrics about my #rituals. Sport is good example - I want to have a place for marking PR's. Why do this in public? I think it will make me more accountable. Also it just seems like a cool thing to do.</p>\n<p>Aggregating and categorising content from different places. <a href=\"https://are.na/danielgalis\">Are.na</a> + Obsidian basically, but in a structured, non-intrusive way. Linking channels on <a href=\"https://are.na/danielgalis\">are.na</a> to tags/notes in Obsidian.</p>\n<p>Experimenting with the interface and interactions. Hopefully building a <strong>tag based search</strong> and <strong>general keyboard interface</strong>.</p>\n<h2 id=\"principles-to-keep-in-mind\" tabindex=\"-1\">Principles To Keep In Mind <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/public-digital-garden/#principles-to-keep-in-mind\">#</a></h2>\n<ul>\n<li>A tool for me first, an interface with the public second.</li>\n<li>Less is more.</li>\n<li>Experiment.</li>\n</ul>\n",
			"date_published": "2023-07-14T00:00:00Z"
		}
		,
		{
			"id": "https://danielgalis.com/posts/keybot/",
			"url": "https://danielgalis.com/posts/keybot/",
			"title": "Keybot - Exploring Research Through Design",
			"content_html": "<h1 id=\"introduction\" tabindex=\"-1\">Introduction <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#introduction\">#</a></h1>\n<p>The research interaction project, known as <strong>Keybot</strong>, addresses the challenge of limited key access in shared studio workspaces at design and art schools. Typically, only a single shared key is available, causing repetitive and frustrating interactions for individuals seeking entry. To facilitate this process, I designed and constructed a device to automatically notify colleagues of someone's presence, indicating that the doors are already unlocked. By simply placing the key in its usual location, the device handles communication automatically.</p>\n<p>The aim of <strong>Keybot</strong> is to replace cumbersome human interactions with a robotic solution while maintaining a sense of communal connection. Initially, one might assume that reducing human-to-human interactions, even the annoying ones, could diminish the team's dynamics, which is not the desired outcome. Therefore, the tension lies in designing a device that automates the tedious aspects while nurturing the communal atmosphere within the shared workspace.</p>\n<h2 id=\"research-through-design\" tabindex=\"-1\">Research Through Design <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#research-through-design\">#</a></h2>\n<p>In the spring/summer of 2023, I participated in the studio course titled &quot;Research with Yo-Yo Machines – exploring context, form, and function&quot; led by visiting educator Alma Leora Culén. This course delved into the realm of Research Through Design (RtD) and interaction design through a multifaceted approach. It was comprised of theoretical studies, hands-on workshops for ideation and creation, and practical exploration of the do-it-yourself (DIY) playful communication devices known as <a href=\"https://www.yoyomachines.io/\">Yo-Yo Machines</a>. The present project serves as the outcome of this course.</p>\n<p><em>fig.N: Knock Knock Yo-Yo Machine</em> ![[attachments/knock-knock.png]]</p>\n<h2 id=\"identifying-an-opportunity-streamlining-access-to-shared-workspaces\" tabindex=\"-1\">Identifying an Opportunity: Streamlining Access to Shared Workspaces <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#identifying-an-opportunity-streamlining-access-to-shared-workspaces\">#</a></h2>\n<p>As a student at FaVU, a fine arts and design school with discipline-oriented studios, I observed a problem regarding access to shared workspaces. Each studio is based in a physical space where members can work, study, and socialise. However, despite the presence of up to 30 members in each studio, only a single key is available at the reception. This situation requires individuals to check out the key at the reception every time they want to enter the studio, resulting in unnecessary time and effort, particularly when someone is already present inside the studio.</p>\n<p>In Design Studio 1, where I'm a member, frequent visits occur but not on a regular schedule that can be predicted solely by time. Moreover, our studio, along with eight others, is located in a separate building from the reception, amplifying the inconvenience of back-and-forth trips to borrow the key.</p>\n<p>This limitation led to an inconsistent pattern of communication within our studio. However, responses were not always timely or reliable. Recognising the negative impact of these disruptions and the need for a more streamlined and pleasant solution, I began contemplating the development of an automated key-sharing process based on the emergent behaviour within our group.</p>\n<p>In summary, this initial observation of the inefficiency and inconvenience caused by the single shared key system at FaVU prompted me to explore the design and development of the <strong>Keybot</strong> interaction design project. The project aims to address the problem of key access in shared workspaces by leveraging existing communication practices and creating an automated solution for letting peers know about your presence.</p>\n<h1 id=\"studies\" tabindex=\"-1\">Studies <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#studies\">#</a></h1>\n<h2 id=\"the-tension-of-automation\" tabindex=\"-1\">The Tension of Automation <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#the-tension-of-automation\">#</a></h2>\n<p>Automation has long been seen by some as a force that erodes humanity, individuality, tenderness, and genuine connections. Throughout history, our society has regularly raised concerns about automation. Currently, the focus of scrutiny is Artificial Intelligence (AI). Will AI lead to increased control or more freedom? Will it create more jobs or fewer jobs? And most importantly, will it render humans obsolete? These discussions typically revolve around the broader impact on society, but what about the impact on our interpersonal relationships, our sense of community, and our everyday human interactions?</p>\n<p>Bringing the focus back to my project, I ask a fundamental question: Can automating even a seemingly innocuous task like key sharing diminish the qualities of a community by eliminating various micro-interactions? Furthermore, can humanist interaction design mitigate these negative effects and perhaps even create new opportunities for fostering stronger bonds within a group?</p>\n<h2 id=\"humanist-technology-from-emergent-behaviour\" tabindex=\"-1\">Humanist Technology from Emergent Behaviour <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#humanist-technology-from-emergent-behaviour\">#</a></h2>\n<p>Instead of imposing technology-driven changes on people's behaviour, I believe that technology should adapt to accommodate people's existing behaviours. Thus, my design process for <strong>Keybot</strong> began by examining the communication patterns surrounding key sharing that were already established in our studio.</p>\n<p>The most prevalent pattern involved individuals sending a message to the group Discord server when they were en route to the studio, inquiring about whether someone was already present. However, this method proved unreliable as not everyone had notifications enabled or wanted to be distracted from their tasks by responding promptly. If a response arrived at all, it often arrived too late. Nevertheless, on the occasions when this method succeeded, it worked seamlessly. To capture this successful dynamic, I collected messages announcing members' presence in the shared space and repurposed them as messages generated by the automated system. By utilising an array of human-written messages, my intention is to foster a more friendly and personable experience compared to an automated, repetitive response.</p>\n<p>Another, less frequent pattern proved to be even more useful. Some individuals would send notification messages immediately after unlocking or locking the studio. This enabled anyone on their way to open the group server and check the current status in the appropriate chat channel. I aimed to build upon this pattern and automate the process.</p>\n<h2 id=\"chat-as-a-platform\" tabindex=\"-1\">Chat as a platform <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#chat-as-a-platform\">#</a></h2>\n<p>Smartphones and apps are currently the go-to solutions for addressing communication challenges. With these ubiquitous internet-connected devices always at our disposal, they serve as versatile platform for various tools. The prevailing approach in mainstream technology development revolves around creating dedicated apps due to their widespread usage.</p>\n<p>However, I contend that <em>chat</em>, an integral part of maintaining and organising a group of humans in the digital age, can also be a platform for prototyping technology. Instead of relying on complex coding, prototypes can be built using social conventions and simple text formatting. I have witnessed and participated in using chats as platforms for various purposes such as reading clubs, habit trackers, diaries, complex polls, wikis, directories, and even art projects. Over time, intentionally or organically (or a combination thereof), the chat evolves and transcends its original purpose.</p>\n<p><em>fig.N: Reading club inside a chat</em> ![[attachments/reading_club.png]]</p>\n<p>The key element in developing tools within a chat environment lies in establishing shared social conventions. The group of users must reach a consensus on how and when the chat transitions into a distinct tool, determining its designated functionalities and behaviours.</p>\n<h3 id=\"discord-bots\" tabindex=\"-1\">Discord Bots <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#discord-bots\">#</a></h3>\n<p>Discord, a chat application, offers an exceptionally fertile environment for unconventional uses. Users can establish private or public servers, each comprising multiple chats known as channels, which are further compartmentalised into categories. This setup, coupled with the flexibility of markup text formatting, channel mentions, user mentions, and emoji reactions, provides a highly adaptable digital substrate. Moreover, an additional layer of customisation is afforded through the utilisation and sharing of <strong>bots</strong>—programmable robot users capable of performing a wide range of tasks. These tasks can span from playing music in voice-chat to autonomous server moderation or even interfacing with entirely separate digital services. In the development of <strong>Keybot</strong>, I have harnessed the power of a Discord bot as the underlying communication technology, sidestepping the need to develop another app.</p>\n<h2 id=\"single-purpose-computers\" tabindex=\"-1\">Single-purpose Computers <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#single-purpose-computers\">#</a></h2>\n<p>The majority of our computing activities, including chatting, occur on general-purpose devices such as desktops, laptops, tablets, and the aforementioned smartphones. These devices are capable of performing a wide range of tasks, offering hyper-generalized interfaces as a result. They have become indispensable tools for participating in society and resolving everyday challenges.</p>\n<p>In contrast, single-purpose or special-purpose computers occupy the other end of the computer design spectrum. These computers are purpose-built with a singular objective in mind, providing a specialised interface tailored to specific interactions. This singular focus enables simplicity, as seen in Dieter Rams's devices, and tactility, exemplified by retro gaming cabinets. The limitations imposed by their singular function allow for a greater emphasis on the quality and aesthetics of the interaction.</p>\n<p><em>fig.N: Specialised computer interface for manual atmospheric reentry on the Soyuz spacecraft</em> ![[attachments/soyuz.png]]</p>\n<p>From a physical environment design standpoint, the concept of the single-purposed <strong>Keybot</strong> computer drew inspiration from an existing feature in our studio—a simple nail positioned next to the door where the key should always hang. By leveraging this analog nail, I positioned my device in the same location, striving for near invisibility to minimise friction and facilitate a seamless transition to the new device.</p>\n<p><em>fig.N: The original nail</em> ![[attachments/key_nail.png]]</p>\n<h1 id=\"exploring-interactions\" tabindex=\"-1\">Exploring Interactions <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#exploring-interactions\">#</a></h1>\n<h2 id=\"chat-connected-key-sensor-interaction\" tabindex=\"-1\">Chat Connected Key Sensor Interaction <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#chat-connected-key-sensor-interaction\">#</a></h2>\n<p>The core interaction of <strong>Keybot</strong> makes use of a sensor designed to detect the presence of a key. Once the sensor detects a key hanging of it, a message that is sent to a specific Discord chat channel, which serves as the platform for interacting with the device over the internet.</p>\n<p><em>fig.N: Interaction on entry</em> ![[attachments/interaction_entry.png]]</p>\n<p>Applying the same principle, when the sensor no longer detects a key, it assumes that everyone is leaving the studio, and that the key will be returned to the reception. Studio members are notified of this through a message in a designated chat channel, just as with the <em>on entry</em> interaction described in <em>fig.N</em>.</p>\n<h2 id=\"accounting-for-human-error\" tabindex=\"-1\">Accounting for Human Error <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#accounting-for-human-error\">#</a></h2>\n<p>During discussions with my fellow studio members, valuable feedback was received regarding the potential for human error in remembering to hang the key. Right now, it is possible to unintentionally take the key home if it is left in one's pocket, which is frustrating. This could also pose challenges for the functionality of <strong>Keybot</strong>.</p>\n<p>To address this issue, I explored various solutions that would account for human error. I dismissed options such as a doorframe sensor or an electromagnetic lock as they were either too intrusive or did not fully resolve the problem.</p>\n<p>At one point, I became engrossed in researching different types of clocks. My hypothesis was that incorporating a secondary function into the device could increase the likelihood of people noticing it. While the idea of constructing an alternative clock still captivates me, it was not feasible within the project's timeframe.</p>\n<h2 id=\"knock-interaction-inspired-by-yo-yo-machines\" tabindex=\"-1\">Knock Interaction Inspired by Yo-Yo Machines <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#knock-interaction-inspired-by-yo-yo-machines\">#</a></h2>\n<p>In the final design of <strong>Keybot</strong>, I drew inspiration from the Yo-Yo Machines project, specifically the &quot;Knock-knock&quot; machine. This machine utilises a piezo microphone to listen to human knocks and replicates the pattern on a paired machine using a solenoid. Both machines can function as both the input and the output.</p>\n<p>The symbolism of knocking, as a means of communication through closed doors, resonated with me, and I decided to adapt this technology for a slightly different purpose. In the <strong>Keybot</strong> device, the solenoid is also employed to produce a knocking sound, serving as a way to capture the attention of someone in the studio. If you are on your way and there is no notification of the doors being unlocked, you can send a message containing the word &quot;knock&quot; in the designated chat. In the event that someone is already in the studio but has forgotten to hang the key, the sound, accompanied by a flashing blue LED, aims to grab their attention, prompting them to hang the key.</p>\n<p><em>fig.N: Knock Interaction</em> ![[attachments/interaction_knock.png]]</p>\n<h1 id=\"putting-it-together-in-practice\" tabindex=\"-1\">Putting It Together In Practice <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#putting-it-together-in-practice\">#</a></h1>\n<h2 id=\"the-brain-esp-32\" tabindex=\"-1\">The brain: ESP-32 <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#the-brain-esp-32\">#</a></h2>\n<p>The ESP-32 serves as a compact internet-connected computer capable of powering and controlling electrical components. Technically speaking, it is a low-cost, low-power system-on-a-chip microcontroller with integrated Wi-Fi. This microcontroller was also employed in the Yo-Yo Machines project. In the making of <strong>Keybot</strong>, I specifically worked with the ESP32-DevKitc-V4 development board.</p>\n<h2 id=\"capacitive-touch-sensor\" tabindex=\"-1\">Capacitive Touch Sensor <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#capacitive-touch-sensor\">#</a></h2>\n<p>A capacitive touch sensor operates by detecting changes in capacitance caused by the proximity or touch of a conductive object, such as a finger or metal key.</p>\n<p>The ESP-32 module is utilised to measure the capacitance of the touch sensor, determining the presence or absence of a conductive object. This can be accomplished using the built-in capacitive touch sensing hardware of the ESP32 or by connecting an external capacitive touch sensor to the GPIO pins of the module. In my case, I connected a screw to serve as a place to hang the key by its keyring.</p>\n<h2 id=\"generating-light-and-sound\" tabindex=\"-1\">Generating Light and Sound <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#generating-light-and-sound\">#</a></h2>\n<p>Drawing inspiration once again from the Yo-Yo Machines project, I incorporated similar hardware components, including an addressable RGB LED and a small MOSFET module. The MOSFET module facilitates control of a small push-pull solenoid, which produces the knocking sound as it bangs against the wall of the casing.</p>\n<h2 id=\"wiring-it-all-up\" tabindex=\"-1\">Wiring It All Up <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#wiring-it-all-up\">#</a></h2>\n<p>In the early prototyping stage, a breadboard and some Dupont cables were used to test the functionality of the hardware and firmware. In the final prototype, a combination of Dupont cables, and traditional soldering methods take care of the electrical connections.</p>\n<p><em>fig.N: Prototyping</em> ![[attachments/breadboard.jpg]]</p>\n<h2 id=\"coding-the-firmware\" tabindex=\"-1\">Coding The Firmware <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#coding-the-firmware\">#</a></h2>\n<p>The microcontroller can be programmed using the C programming language. For this project, I chose to code in the ESP-IDF framework developed by Esspressif, the same company that manufactures the ESP-32 microcontroller. I made this decision because of the availability of an <a href=\"https://github.com/abobija/esp-discord\">open-source library</a> designed for the ESP-IDF framework, which simplifies the interaction with a Discord bot. Additionally, I leveraged code snippets from various open-source example projects to control the other components, significantly streamlining the firmware development process.</p>\n<h2 id=\"making-the-casing\" tabindex=\"-1\">🚧 Making The Casing <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#making-the-casing\">#</a></h2>\n<p>I opted for a 3D printed casing for the device, enabling me to quickly obtain a sturdy and precise prototype. I employed a CAD software to design the casing, and the final 3D model is publicly available on the internet. I also utilised paper and styrofoam mockups, allowing for a more hands-on approach to solving any model-related issues during the design process.</p>\n<p><em>fig.N: Paper Mockup Of The Casing</em> ![[attachments/paper_prototype.jpg]]\n<em>fig.N: Bottom Half Of The Casing Model</em> ![[attachments/case_bottom.png]]\n<em>fig.N: Top Half Of The Casing Model</em> ![[attachments/case_top.png]]</p>\n<p>The initial 3D print had some imperfections, as expected, prompting me to revise and refine the design accordingly. Furthermore, I conducted a poll within the studio's Discord server to gather opinions on whether to keep the &quot;KEY BOT&quot; logo. The response was overwhelmingly against it, which pleased me, as I shared the same sentiment.</p>\n<p><em>fig.N: First Printed Version Of The Casing</em> ![[attachments/key-bot_installed.jpg]]</p>\n<ul>\n<li>[ ] ADD: photos of the second version</li>\n</ul>\n<h1 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#conclusion\">#</a></h1>\n<h2 id=\"from-the-particular-to-the-universal\" tabindex=\"-1\">From the particular to the universal <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#from-the-particular-to-the-universal\">#</a></h2>\n<p>I believe that by focusing on immediate problems, challenges, and tensions in your surroundings, the proposed design solutions can achieve the highest quality. The outcome of designing out of one's own experience can be described as a version of the &quot;ultimate particular&quot;<sup class=\"footnote-ref\"><a href=\"https://danielgalis.com/posts/keybot/#fn1\" id=\"fnref1\">[1]</a></sup>. From this particular context, a more universal artefact can be derived and applied effectively in a multitude of situations.</p>\n<p>The <strong>Keybot</strong> device emerged from a specific context within design and art studios at universities. However, with a bit of imagination, it can be adapted to a wide range of situations where signalling one's presence is crucial. For instance, instead of being triggered by hanging, the capacitive sensor could be activated by the touch of an elderly person who has just arrived to participate in a workshop.</p>\n<p>To encourage further modification and exploration, I have made all the code, 3D models, parts list, and instructions available on the <a href=\"https://github.com/mstcgalis/Keybot\">GitHub</a> platform. These resources are provided under the permissive open-source license GPL3, allowing others to build upon and customise the <strong>Keybot</strong> device according to their own requirements and contexts.</p>\n<h2 id=\"systems-thinking-perspective\" tabindex=\"-1\">Systems Thinking Perspective <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#systems-thinking-perspective\">#</a></h2>\n<p>I want to acknowledge my own criticism of this project, which is that it doesn't address the underlying issue of having only one key available; instead, it focuses on alleviating the symptoms. Alternative approaches could have involved attempting to change the school's system or creating unofficial copies of the key for everyone. It's possible that one of these scenarios may occur in the future, rendering <strong>Keybot</strong> obsolete. However, despite considering this perspective, I am not overly concerned. This project has provided valuable learning experiences and has been a highly enjoyable endeavour.</p>\n<h2 id=\"reflection-wip\" tabindex=\"-1\">🚧 Reflection (WIP) <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#reflection-wip\">#</a></h2>\n<p>I will finish this section after the final examination.\n![[key-hook-cat.gif]]</p>\n<h3 id=\"reference\" tabindex=\"-1\">Reference: <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/keybot/#reference\">#</a></h3>\n<hr class=\"footnotes-sep\">\n<section class=\"footnotes\">\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Fallman, D. (2008). The Interaction Design Research Triangle of Design Practice, Design Studies, and Design Exploration. Design Issues, 24(3), 4-18. <a href=\"https://danielgalis.com/posts/keybot/#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>\n</section>\n",
			"date_published": "2023-06-03T00:00:00Z"
		}
		,
		{
			"id": "https://danielgalis.com/posts/ritual-sketching/",
			"url": "https://danielgalis.com/posts/ritual-sketching/",
			"title": "Ritual Sketching - A Creative Approach to Habit Tracking",
			"content_html": "<p>Can tracking become an exciting and creative practice instead of a boring chore? As a part of my <a href=\"https://www.are.na/prompt-club/tool-a-week\">TOOL A WEEK</a> commitment, I worked on a better habit-tracking method, that anyone could potentially modify and use on their journey. After a week of ideation, research, sketching, prototyping and a round of feedback from designer friends, I created a customisable system called <strong>Ritual Sketching</strong>.</p>\n<p>First some definitions:</p>\n<p>From <a href=\"https://en.wikipedia.org/wiki/Habit\">Wikipedia</a>:</p>\n<blockquote>\n<p>A <strong>habit</strong>  is a routine of behaviour that is repeated regularly and tends to occur subconsciously.</p>\n</blockquote>\n<p>For the sake of this tool, I will define <strong>ritual</strong> as a positive habit being built intentionally and performed mindfully. Beyond repetition, rituals can provide a way to structure time and direct one's attention to meaningful pursuits.</p>\n<p>Like many others, I have been slowly trying to build everyday habits since reading James Clear's amazing Atomic Habits. One of the techniques he recommends is &quot;habit tracking&quot; - keeping a record of how consistently you are performing certain activities, hence turning them into habits. You can read about the benefits of tracking in this <a href=\"https://www.are.na/block/14441936\">summary</a>.</p>\n<h1 id=\"my-experience-with-habit-tracking\" tabindex=\"-1\">My experience with habit tracking <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#my-experience-with-habit-tracking\">#</a></h1>\n<p><img src=\"https://danielgalis.com/posts/attachments/table_tracker.png\" alt=\"table tracker\"></p>\n<p>For a total time of about 2 months, I've used an analogue tracker in the form of a spreadsheet printed on an A4. Here are my thoughts:</p>\n<h3 id=\"the-good\" tabindex=\"-1\">The Good <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#the-good\">#</a></h3>\n<ul>\n<li>analogue tracking is very satisfying</li>\n<li>hanging on the wall next to my table creates a physical presence in my environment, which is very powerful</li>\n</ul>\n<h3 id=\"the-bad\" tabindex=\"-1\">The bad <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#the-bad\">#</a></h3>\n<ul>\n<li>tracking only a boolean value is reductive</li>\n<li>leads to performing a habit for the sake of the tracker, not for its own sake</li>\n<li>analogue is not practical for travelling</li>\n<li>placement on the wall is not practical for moving about</li>\n</ul>\n<h3 id=\"the-ugly\" tabindex=\"-1\">The ugly <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#the-ugly\">#</a></h3>\n<p>I'm not saying spreadsheets aren't beautiful, but the look quickly became stale and office-like. This is exactly the vibe I want to steer away from.</p>\n<h1 id=\"the-ritual-sketching-method\" tabindex=\"-1\">The Ritual Sketching method <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#the-ritual-sketching-method\">#</a></h1>\n<p>The goal of <strong>Ritual Sketching</strong> is to keep a record of your habits with compounding, generative compositions. Instead of ticking a checkbox, the person using this method will create a sketch in their <strong>log</strong> according to a predetermined <strong>key</strong>. This sketch should reflect their habits on a particular day.</p>\n<p>The <strong>key</strong> pairs each habit with a thing to draw. For example, my current key looks like this:</p>\n<pre class=\"language-python\" tabindex=\"0\"><code class=\"language-python\">PERFORM   <span class=\"token punctuation\">:</span>   DRAW<br>meditate  <span class=\"token punctuation\">:</span>   line<br>mantra    <span class=\"token punctuation\">:</span>   ellipse<br>excersize <span class=\"token punctuation\">:</span>   polygon<br>read      <span class=\"token punctuation\">:</span>   rectangle<br>write     <span class=\"token punctuation\">:</span>   squiggle<br>design    <span class=\"token punctuation\">:</span>   star<br>code      <span class=\"token punctuation\">:</span>   dots</code></pre>\n<p>In the <strong>log</strong>, each day should have its section with a <strong>star(t)</strong> placed in the middle of that section. The <strong>star(t)</strong> defines the x and the y axes, providing an &quot;artificial&quot; anchor on which the &quot;natural&quot; sketching can take place. Digital example:</p>\n<p><img src=\"https://danielgalis.com/posts/attachments/tracker_start.png\" alt=\"star(t) of the tracker\"></p>\n<p>When a person performs a certain habit, they draw the corresponding thing into today's section of the <strong>log</strong>. This continues throughout the day as the shapes slowly compound into a composition. A the end of the day a sketch containing information on today's activities emerges. Even though the <strong>key</strong> stays the same, each daily sketch will inevitably be unique. Seeing the effort already put in, the daily <strong>log</strong> should act as a source of motivation, as breaking the chain with an empty <strong>star(t)</strong> will not feel right. After some time has passed, changes, fluctuations, exceptions and maybe even trends can be observed.</p>\n<p>With sketching, there's a lot of opportunity for non-boolean reflectivity. Some simple ideas to start with:</p>\n<ul>\n<li>the size of the shape reflects the length of the ritual</li>\n<li>the placement of the shape reflects the time of day the ritual was performed</li>\n</ul>\n<h1 id=\"my-implementation-and-templates\" tabindex=\"-1\">My implementation and templates <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#my-implementation-and-templates\">#</a></h1>\n<p><strong>Ritual Sketching</strong> as a system and practice can be implemented in many different forms. Here I will provide my implementation(s) along with some templates to get you started!</p>\n<p>I started using an analogue tracker printed on an A4 which I hang next to my desk. One sheet contains 5 rows of 7 <strong>start(s)</strong> for a total of 35 days, which is more than enough for a month's worth of sketching. The key is printed at the top along with a space to fill out the <strong>start</strong> and <strong>end</strong> dates.</p>\n<h3 id=\"pdf-templates\" tabindex=\"-1\">PDF Templates: <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#pdf-templates\">#</a></h3>\n<ul>\n<li><a href=\"https://danielgalis.com/posts/attachments/templates_tracker/MINE.pdf\">the exact one I use</a></li>\n<li><a href=\"https://danielgalis.com/posts/attachments/templates_tracker/BLANK_BLANK.pdf\">fully blank</a></li>\n<li><a href=\"https://danielgalis.com/posts/attachments/templates_tracker/BLANK_SHAPES.pdf\">blank rituals + &quot;shapes&quot; key</a></li>\n<li><a href=\"https://danielgalis.com/posts/attachments/templates_tracker/BLANK_ABSTRACT.pdf\">blank rituals + &quot;abstract&quot; key</a></li>\n<li><a href=\"https://danielgalis.com/posts/attachments/templates_tracker/BLANK_OBJECTS.pdf\">blank rituals + &quot;objects&quot; key</a></li>\n</ul>\n<h1 id=\"update\" tabindex=\"-1\">Update <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#update\">#</a></h1>\n<p>After ~2 weeks of tracking on the wall, I switched to using a notebook. Each day gets its own page split into two sections: <strong>tasks</strong> on the top and <strong>ritual sketching</strong> on the bottom. I think the portability of the notebook makes me use the tracker more, plus it just feels more cozy. I'll make sure to update this post if I try any other modifications or implementations.</p>\n<p><img src=\"https://danielgalis.com/posts/attachments/notebook_tracker.jpeg\" alt=\"photo of my notebook\"></p>\n<h1 id=\"final-thoughts\" tabindex=\"-1\">Final thoughts <a class=\"header-anchor\" href=\"https://danielgalis.com/posts/ritual-sketching/#final-thoughts\">#</a></h1>\n<p>I'm looking forward to using this technique in the coming months, as only time will tell how well it truly works. Then there's an exciting idea I got from my friends - to implement <strong>Ritual Sketching</strong> in a paper notebook or some kind of digital space, both of which will provide an affordance to &quot;animate&quot; individual sketches into a moving picture. I'll post an update once I gather more experiences, thoughts and prototypes. Thanks for reading!</p>\n",
			"date_published": "2023-04-02T00:00:00Z"
		}
		
	]
}
